---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationService Methods
FabricationService Class See Also Send Feedback
---

The FabricationService type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetButton | Gets the service button for a given palette index and button index from the service. |
|  | GetButtonCount | Gets the number of buttons for a given palette in the service. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetPaletteName | Gets the name of a palette based on palette index. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | IsCompatibleWith | Check whether the service is broadly interchangable with another one without affecting part geometry. The services must have the same fabrication system template and specification. |
|  | IsPaletteExcluded | Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions. |
|  | IsValidButtonIndex | Validates the button index. |
|  | IsValidPaletteIndex | Validates the palette index. |
|  | OverrideServiceButtonExclusion | Overrides the default service button exclusions, used by Route and Fill, Design to Fabrication, or Multi Point Routing for the current user and session only. |
|  | ResetServiceExclusionOverrides | Resets the overridden service palette and button exclusions back to default, as defined by the configuration. |
|  | SetServicePaletteExclusions | Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

FabricationService Class

Autodesk.Revit.DB Namespace